utils/load-test.yml
# artillery run load-test.yml --record --key YOUR_API_KEY
# artillery run -o myReport load-test.yml
# artillery report myReport
config:
  target: https://api.reditus.site
#  http:
#    defaults:
#      headers:
#        Authorization: "Bearer eyJhbGciOiJIUzI1NiJ9.eyJzdWIiOiIxIiwicm9sZSI6IkFETUlOIiwiaXNBY2Nlc3MiOnRydWUsImlhdCI6MTcxOTgyOTAzOSwiaXNzIjoicmVkaXR1cyIsImV4cCI6MTcxOTgzMDgzOX0.png_zj5GuWl-GWHz_mkV2x3vHEt6aL_HHw5ZuzfzwDs"
  phases:
    - duration: 5 # 5 seconds
      arrivalRate: 10 # 5 users per second
      # rampTo: 5 # 10 users per second
      name: "Warm up"

    - duration: 5 # 5 seconds
      arrivalRate: 20 # 10 users per second
      name: "Ramping up"

    # - duration: 5
    #   arrivalRate: 20
    #   name: "Sustained load"

scenarios:
  - flow:
      - loop: # loop through the following steps 5 times
          - get:
              url: "/api/articles?page=0&size=10"
          - get:
              url: "/api/articles/12"
          - get:
              url: "/api/articles/151"
          - get:
              url: "/api/articles/12123"
        count: 1 # 1 times